INSERT INTO empl.employees (asutr_personnel_number, employee_surname, employee_name, employee_patronymic, employee_type, job_title_abbreviation, job_title)
  VALUES
  (1000000, 'Шевцов', 'Евгений', 'Александрович', 'Руководитель',
    'ЦДИ', 'Заместитель генерального директора ОАО «РЖД» - начальник Центральной дирекции инфраструктуры'),
  (1000001, 'Глазков', 'Михаил', 'Олегович', 'Руководитель', 'ЦД',
    'Заместитель генерального директора ОАО «РЖД» - начальник Центральной дирекции управления движением'),
  (1000002, 'Залива', 'Денис', 'Викторович', 'Руководитель', 'ЦП',
    'Начальник управления пути и сооружений Центральной дирекции инфраструктуры'),
  (1000003, 'Орехов', 'Эдуард', 'Геннадьевич', 'Руководитель', 'ЦШ',
    'Начальник управления автоматики и телемеханики Центральной дирекции инфраструктуры'),
  (1000004, 'Голубец', 'Валерий', 'Германович', 'Руководитель', 'ВЗ Н',
    'Начальник Восточно-западной железной дороги'),
  (1000005, 'Бефстроганов', 'Семён', 'Семёнович', 'Руководитель', 'НЗтер-1',
    'Заместитель начальника Восточно-западной железной дороги по Где-нибудьскому территориальному управлению'),
  (1000006, 'Рахатлукумов', 'Разиль', 'Ахметович', 'Руководитель', 'ВЗДИ',
    'Начальник Восточно-западной дирекции инфраструктуры'),
  (1000007, 'Морковин', 'Павел', 'Николаевич', 'Руководитель', 'ВЗД',
    'Начальник Восточно-западной дирекции управления движением'),
  (1000008, 'Молочко', 'Роман', 'Тимофеевич', 'Руководитель', 'ВЗП',
    'Начальник службы пути Восточно-западной дирекции инфраструктуры'),
  (1000009, 'Шпротов', 'Клим', 'Александрович', 'Руководитель', 'ВЗШ', 'Начальник службы телемеханики и автоматики'),
  (1000010, 'Огурчиков', 'Сергей', 'Васильевич', 'Руководитель', 'ДИЗтер-1',
    'Заместитель начальника Восточно-западной дирекции инфраструктуры — начальник Где-нибудьского отдела инфраструктуры'),
  (1000011, 'Сметанников', 'Артём', 'Уралович', 'Руководитель', 'ДЦС-1',
    'Начальник Где-нибудьского центра организации работы железнодорожных станций'),
  (1000012, 'Маслов', 'Степан', 'Андреевич', 'Руководитель', 'ДС',
    'Начальник станций Кое-гденьск и Кое-гденьск грузовая'),
  (1000013, 'Котлетова', 'Лариса', 'Владимировна', 'Руководитель', 'ДС', 'Начальник станций Где-либо и Здеся'),
  (1000014, 'Вермишель', 'Сюзанна', 'Шахназаровна', 'Руководитель', 'ДС', 'Начальник станции Где-нибудьск'),
  (1000015, 'Пельмешкин', 'Игорь', 'Николаевич', 'Руководитель', 'ПЧ', 'Начальник Кое-гденьской дистанции пути'),
  (1000016, 'Сиропов', 'Валерий', 'Леонович', 'Руководитель', 'ПЧЗ', 'Заместитель начальника Кое-гденьской дистанции пути'),
  (1000017, 'Похлебкин', 'Дмитрий', 'Петрович', 'Руководитель', 'ПЧГ', 'Главный инженер Кое-гденьской дистанции пути'),
  (1000018, 'Винишкина', 'Елизавета', 'Демьяновна', 'Руководитель', 'НПТО', 'Начальник производственно-технического отдела'),
  (1000019, 'Шашлыков', 'Евгений', 'Рудольфович', 'Специалист', 'ПЧБ', 'Ведущий инженер'),
  (1000020, 'Арбузников', 'Олег', 'Степанович', 'Руководитель', 'ПДМ', 'Начальник участка производства'),
  (1000021, 'Семечкин', 'Ленар', 'Валерьевич', 'Руководитель', 'ПДдеф', 'Начальник участка диагностики'),
  (1000022, 'Фаршев', 'Роман', 'Анатольевич', 'Рабочий', 'КСП', 'Контролер состояния железнодорожного пути'),
  (1000023, 'Мёдулин', 'Тимур', 'Русланович', 'Рабочий', 'КСП', 'Контролер состояния железнодорожного пути'),
  (1000024, 'Леденцова', 'София', 'Никитична', 'Руководитель', 'ФЭС', 'Начальник финансово-экономического сектора'),
  (1000025, 'Мясцов', 'Георгий', 'Маратович', 'Руководитель', 'ПЧУ-1', 'Начальник 1-го эксплуатационного участка'),
  (1000026, 'Курочкина', 'Елена', 'Патриковна', 'Специалист', 'ПЧТ', 'Техник 1-го эксплуатационного участка'),
  (1000027, 'Мармеладова', 'София', 'Федоровна', 'Специалист', 'ПЧТ', 'Техник 1-го эксплуатационного участка'),
  (1000028, 'Салатов', 'Константин', 'Тимофеевич', 'Руководитель', 'ПД-1', 'Дорожный мастер 1-го линейного участка'),
  (1000029, 'Кебаб', 'Видади', 'Минтимер оглы', 'Руководитель', 'ПДБ', 'Бригадир пути 1-го линейного участка'),
  (1000030, 'Жаркоев', 'Иван', 'Робертович', 'Рабочий', 'м/п', 'Монтер пути'),
  (1000031, 'Компотов', 'Харитон', 'Михайлович', 'Рабочий', 'м/п', 'Монтер пути'),
  (1000032, 'Пиццин', 'Никита', 'Рафаэльевич', 'Рабочий', 'м/п', 'Монтер пути'),
  (1000033, 'Гуляшов', 'Ирек', 'Сафарович', 'Рабочий', 'м/п', 'Монтер пути'),
  (1000034, 'Щербетов', 'Фагим', 'Фаридович', 'Рабочий', 'м/п', 'Монтер пути'),
  (1000035, 'Капустин', 'Павел', 'Олегович', 'Рабочий', 'м/п', 'Монтер пути'),
  (1000036, 'Соусов', 'Дмитрий', 'Васильевич', 'Рабочий', 'м/п', 'Монтер пути'),
  (1000037, 'Фрикаделькин', 'Виталий', 'Михайлович', 'Рабочий', 'м/п', 'Монтер пути'),
  (1000038, 'Борщева', 'Екатерина', 'Савельевна', 'Рабочий', 'с', 'Сигналист'),
  (1000039, 'Рататуев', 'Федор', 'Александрович', 'Руководитель', 'ПД-2', 'Дорожный мастер 2-го линейного участка'),
  (1000040, 'Кофеёчков', 'Денис', 'Петрович', 'Руководитель', 'ПДБ', 'Бригадир пути 2-го линейного участка'),
  (1000041, 'Мороженных', 'Станислав', 'Кондратьевич', 'Рабочий', 'м/п', 'Монтер пути'),
  (1000042, 'Сахаров', 'Игорь', 'Яковлевич', 'Рабочий', 'м/п', 'Монтер пути'),
  (1000043, 'Супов', 'Николай', 'Степанович', 'Рабочий', 'м/п', 'Монтер пути'),
  (1000044, 'Долмаян', 'Закари', 'Сержевич', 'Рабочий', 'м/п', 'Монтер пути'),
  (1000045, 'Соков', 'Ярослав', 'Дмитриевич', 'Рабочий', 'м/п', 'Монтер пути'),
  (1000046, 'Крыжовников', 'Георгий', 'Дмитриевич', 'Рабочий', 'м/п', 'Монтер пути'),
  (1000047, 'Клубника', 'Руслан', 'Леонидович', 'Рабочий', 'м/п', 'Монтер пути'),
  (1000048, 'Мантов', 'Алексей', 'Сергеевич', 'Рабочий', 'м/п', 'Монтер пути'),
  (1000049, 'Чакчаков', 'Азат', 'Айратович', 'Рабочий', 'с', 'Сигналист'),
  (1000050, 'Варенников', 'Виталий', 'Леонидович', 'Руководитель', 'ИЧ', 'Начальник Где-нибудьской дистанции инфраструктуры'),
  (1000051, 'Баклажанов', 'Иван', 'Петрович', 'Руководитель', 'ИЧЗ', 'Заместитель начальника по текущему содержанию пути'),
  (1000052, 'Горохов', 'Игорь', 'Викторович', 'Руководитель', 'ИЧЗШ',
    'Заместитель начальника по текущему содержанию устройств сигнализации централизации и блокировки'),
  (1000053, 'Грушев', 'Василий', 'Игоревич', 'Руководитель', 'ИЧГ', 'Главный инженер Кое-гденьской дистанции пути'),
  (1000054, 'Брокколиева', 'Анна', 'Анатольевна', 'Руководитель', 'НПТО', 'Начальник производственно-технического отдела'),
  (1000055, 'Хачапурина', 'Лиана', 'Давидовна', 'Специалист', 'ПЧБ', 'Ведущий инженер'),
  (1000056, 'Изюмов', 'Максим', 'Ильич', 'Руководитель', 'ПДМ', 'Начальник участка производства'),
  (1000057, 'Вишневская', 'Екатерина', 'Александровна', 'Руководитель', 'ПДдеф', 'Начальник участка диагностики'),
  (1000058, 'Сыров', 'Александр', 'Игоревич', 'Рабочий', 'КСП', 'Контролер состояния железнодорожного пути'),
  (1000059, 'Картошкин', 'Сергей', 'Степанович', 'Рабочий', 'КСП', 'Контролер состояния железнодорожного пути'),
  (1000060, 'Шоколадова', 'Анна', 'Дмитриевна', 'Руководитель', 'ФЭС', 'Начальник финансово-экономического сектора'),
  (1000061, 'Фиников', 'Шавкат', 'Наильевич', 'Руководитель', 'ПЧУ-1', 'Начальник 1-го эксплуатационного участка'),
  (1000062, 'Баклажанова', 'Татьяна', 'Владимировна', 'Специалист', 'ПЧТ', 'Техник 1-го эксплуатационного участка'),
  (1000063, 'Пирожкова', 'Тамара', 'Евгеньевна', 'Специалист', 'ПЧТ', 'Техник 1-го эксплуатационного участка'),
  (1000064, 'Лимонов', 'Константин', 'Эдуардович', 'Руководитель', 'ПД-1', 'Дорожный мастер 1-го линейного участка'),
  (1000065, 'Губадиянов', 'Ильнур', 'Ильсурович', 'Руководитель', 'ПДБ', 'Бригадир пути 1-го линейного участка'),
  (1000066, 'Орехов', 'Илья', 'Валерьевич', 'Рабочий', 'м/п', 'Монтер пути'),
  (1000067, 'Горчицын', 'Тарас', 'Артемович', 'Рабочий', 'м/п', 'Монтер пути'),
  (1000068, 'Кетчупов', 'Тимур', 'Дмитриевич', 'Рабочий', 'м/п', 'Монтер пути'),
  (1000069, 'Макаронович', 'Виктор', 'Михайлович', 'Рабочий', 'м/п', 'Монтер пути'),
  (1000070, 'Ягодкин', 'Яков', 'Павлович', 'Рабочий', 'м/п', 'Монтер пути'),
  (1000071, 'Шаурмов', 'Канат', 'Тамади оглы', 'Рабочий', 'м/п', 'Монтер пути'),
  (1000072, 'Белогрибов', 'Роман', 'Константинович', 'Рабочий', 'м/п', 'Монтер пути'),
  (1000073, 'Чебуреков', 'Захар', 'Дорофеевич', 'Рабочий', 'м/п', 'Монтер пути'),
  (1000074, 'Фундуков', 'Николай', 'Юрьевич', 'Рабочий', 'с', 'Сигналист'),
  (1000075, 'Шницель', 'Леон', 'Оттович', 'Руководитель', 'ПД-2', 'Дорожный мастер 2-го линейного участка'),
  (1000076, 'Оливков', 'Петр', 'Николаевич', 'Руководитель', 'ПДБ', 'Бригадир пути 2-го линейного участка'),
  (1000077, 'Петрушкин', 'Евгений', 'Сергеевич', 'Рабочий', 'м/п', 'Монтер пути'),
  (1000078, 'Чай', 'Рё', 'Пэй', 'Рабочий', 'м/п', 'Монтер пути'),
  (1000079, 'Тмин', 'Синь', 'Го', 'Рабочий', 'м/п', 'Монтер пути'),
  (1000080, 'Маринадов', 'Артур', 'Семёнович', 'Рабочий', 'м/п', 'Монтер пути'),
  (1000081, 'Блинов', 'Павел', 'Олегович', 'Рабочий', 'м/п', 'Монтер пути'),
  (1000082, 'Фрикасе', 'Рафаэль', 'Бенедиктович', 'Рабочий', 'м/п', 'Монтер пути'),
  (1000083, 'Вареньев', 'Сергей', 'Александрович', 'Рабочий', 'м/п', 'Монтер пути'),
  (1000084, 'Кинзин', 'Прохор', 'Андреевич', 'Рабочий', 'м/п', 'Монтер пути'),
  (1000085, 'Шпиков', 'Андрей', 'Алексеевич', 'Рабочий', 'с', 'Сигналист'),
  (1000086, 'Бататский', 'Дмитрий', 'Григорьевич', 'Рабочий', 'Дпп', 'Дежурный по переезду'),
  (1000087, 'Селёдкин', 'Тит', 'Андреевич', 'Рабочий', 'Дпп', 'Дежурный по переезду'),
  (1000088, 'Салямина', 'Вероника', 'Степановна', 'Рабочий', 'Дпп', 'Дежурный по переезду'),
  (1000089, 'Паштетова', 'Клара', 'Геннадьевна', 'Рабочий', 'Дпп', 'Дежурный по переезду'),
  (1000090, 'Буженина', 'Дарья', 'Мирославовна', 'Рабочий', 'Дпп', 'Дежурный по переезду'),
  (1000091, 'Сливов', 'Виктор', 'Константинович', 'Руководитель', 'ШЧУ-1', 'Начальник 1-го эксплуатационного участка'),
  (1000092, 'Кефиров', 'Федор', 'Андреевич', 'Руководитель', 'ШНС', 'Старший электромеханик СЦБ'),
  (1000093, 'Хлебушкин', 'Андрей', 'Анатольевич', 'Рабочий', 'ШЦМ', 'Электромонтер СЦБ'),
  (1000094, 'Салосольский', 'Иван', 'Артурович', 'Руководитель', 'ПЧ', 'Начальник дистанции искусственных сооружений ВЗ ДИ'),
  (1000095, 'Ватрушкина', 'Светлана', 'Прохоровна', 'Руководитель', 'НПТО', 'Начальник производственно-технического отдела'),
  (1000096, 'Икрин', 'Борис', 'Ярославович', 'Руководитель', 'ФЭС', 'Начальник финансово-экономического сектора'),
  (1000097, 'Коктейлев', 'Святослав', 'Денисович', 'Руководитель', 'ПЧУ-1', 'Начальник эксплуатационного участка ИССО'),
  (1000098, 'Фасолин', 'Анатолий', 'Алексеевич', 'Руководитель', 'ПД-1', 'Мостовой мастер'),
  (1000099, 'Бялишев', 'Тагир', 'Нурмагомедович', 'Руководитель', 'ШЧ',
    'Начальник Кое-гденьской дистанции сигнализации, централизации и блокировки'),
  (1000100, 'Кунжутов', 'Тагир', 'Талгатович', 'Руководитель', 'ШЧЗ',
    'Заместитель начальника Кое-гденьской дистанции сигнализации, централизации и блокировки'),
  (1000101, 'Перцев', 'Виниамин', 'Станиславович', 'Руководитель', 'ШЧГ',
    'Главный инженер Кое-гденьской дистанции сигнализации, централизации и блокировки'),
  (1000102, 'Печенькина', 'Ольга', 'Леонидовна', 'Руководитель', 'НПТО', 'Начальник производственно-технического отдела'),
  (1000103, 'Цукатов', 'Виталий', 'Олегович', 'Руководитель', 'ШДМ', 'Начальник участка производства'),
  (1000104, 'Кашина', 'Анастасия', 'Сергеевна', 'Руководитель', 'ФЭС', 'Начальник финансово-экономического сектора'),
  (1000105, 'Сосискин', 'Григорий', 'Игоревич', 'Руководитель', 'ШЧУ-1', 'Начальник 1-го эксплуатационного участка'),
  (1000106, 'Пивасян', 'Карина', 'Дароновна', 'Руководитель', 'ШНС', 'Старший электромеханик СЦБ'),
  (1000107, 'Какаошкин', 'Марат', 'Азатович', 'Рабочий', 'ШЦМ', 'Электромонтер СЦБ'),
  (1000108, 'Пловин', 'Дмитрий', 'Кириллович', 'Рабочий', 'ШЦМ', 'Электромонтер СЦБ');


INSERT INTO empl.central_directorate_employees (employee_id, central_directorate)
  VALUES (1, 'ЦДИ'), (2, 'ЦД');


INSERT INTO empl.central_department_employees (employee_id, central_department)
  VALUES (1, 'ЦП'),
  (2, 'ЦШ');


INSERT INTO empl.railway_employees (employee_id, railway)
  VALUES (5, 'ВЗЖД');


INSERT INTO empl.railway_territorial_department_employees (employee_id, railway_territorial_department_id)
  VALUES (6, 1);


INSERT INTO empl.regional_directorate_employees (employee_id, regional_directorate)
  VALUES (7, 'ВЗДИ'), (8, 'ВЗД');


INSERT INTO empl.regional_department_employees (employee_id, regional_department)
  VALUES (9, 'ВЗП'), (10, 'ВЗШ');


INSERT INTO empl.directorate_territorial_department_employees (employee_id, directorate_territorial_department_id)
  VALUES (10, 1), (11, 2);


INSERT INTO empl.p_distance_employees (employee_id, p_distance_id, job_rank)
  VALUES (16, 1, null), (17, 1, null), (18, 1, null), (19, 1, null), (20, 1, null), (21, 1, null), (22, 1, null),
  (23, 1, 7), (24, 1, 6), (25, 1, null), (26, 1, null), (27, 1, null), (28, 1, null), (29, 1, null), (30, 1, 7),
  (31, 1, 5), (32, 1, 4), (33, 1, 4), (34, 1, 3), (35, 1, 3), (36, 1, 3), (37, 1, 3), (38, 1, 2), (39, 1, 3),
  (40, 1, null), (41, 1, 7), (42, 1, 5), (43, 1, 4), (44, 1, 4), (45, 1, 3), (46, 1, 3), (47, 1, 3), (48, 1, 3), 
  (49, 1, 2), (50, 1, 3),
  (51, 2, null), (52, 2, null), (53, 2, null), (54, 2, null), (55, 2, null), (56, 2, null), (57, 2, null),
  (58, 2, null), (59, 2, 7), (60, 2, 6), (61, 2, null), (62, 2, null), (63, 2, null), (64, 2, null), (65, 2, null),
  (66, 2, 7), (67, 2, 5), (68, 2, 4), (69, 2, 4), (70, 2, 3), (71, 2, 3), (72, 2, 3), (73, 2, 3), (74, 2, 2),
  (75, 2, 3), (76, 2, null), (77, 2, 7), (78, 2, 5), (79, 2, 4), (80, 2, 4), (81, 2, 4), (82, 2, 3), (83, 2, 3),
  (84, 2, 3), (85, 2, 3), (86, 2, 3), (87, 2, 3), (88, 2, 3), (89, 2, 3),
  (90, 3, 3), (91, 3, 3), (95, 3, null), (96, 3, null), (97, 3, null), (98, 3, null), (99, 3, null);


INSERT INTO empl.p_distance_adm_employees (employee_id, p_distance_id)
  VALUES (16, 1), (17, 1), (18, 1), (51, 2), (52, 2), (53, 2), (54, 2), (95, 3);


INSERT INTO empl.p_distance_department_employees (employee_id, p_distance_department_id)
  VALUES (19, 1), (20, 1), (21, 2), (22, 3), (23, 3), (24, 3), (25, 4), (55, 5), (56, 5), (57, 6), (58, 7),
  (59, 7), (60, 7), (61, 8), (96, 9), (97, 10);


INSERT INTO empl.p_exploitative_section_employees (employee_id, p_exploitative_section_id)
  VALUES (26, 1), (27, 1), (28, 1), (62, 2), (63, 2), (64, 2), (98, 3);


INSERT INTO empl.p_linear_section_employees (employee_id, p_linear_section_id)
  VALUES (29, 1), (30, 1), (31, 1), (32, 1), (33, 1), (34, 1), (35, 1), (36, 1), (37, 1), (38, 1), (39, 1),
  (40, 2), (41, 2), (42, 2), (43, 2), (44, 2), (45, 2), (46, 2), (47, 2), (48, 2), (49, 2), (50, 2),
  (65, 3), (66, 3), (67, 3), (68, 3), (69, 3), (70, 3), (71, 3), (72, 3), (73, 3), (74, 3), (75, 3),
  (76, 4), (77, 4), (78, 4), (79, 4), (80, 4), (81, 4), (82, 4), (83, 4), (84, 4), (85, 4), (86, 4), (87, 4), (88, 4),
  (89, 4), (90, 4), (91, 4),
  (99, 5);


INSERT INTO empl.sh_distance_employees (employee_id, sh_distance_id)
  VALUES (100, 4), (101, 4), (102, 4),
  (51, 5), (53, 5);


INSERT INTO empl.sh_distance_department_employees (employee_id, sh_distance_department_id, job_rank)
  VALUES (103, 1, null), (104, 2, null), (105, 3, null);


INSERT INTO empl.sh_exploitative_section_employees (employee_id, sh_exploitative_section_id)
  VALUES (92, 2), (106, 1);


INSERT INTO empl.sh_service_section_employees (employee_id, sh_service_section_id, job_rank)
  VALUES (93, 2, null), (94, 2, 5), (107, 1, null), (108, 1, 5), (109, 1, 4);


INSERT INTO empl.d_station_employees (employee_id, d_station_id)
  VALUES (13, 6), (13, 9), (14, 7), (14, 10), (15, 8);